#!/usr/bin/env python
# -*- coding:utf-8 -*-


#  %d 整数
#  %s 字符串
#  %x 十六进制整数
#  %f 浮点数
print '你好%s, 你的存款是%d万美元' % ('格里芬', 100)
print '十进制整数%d的十六进制形式为%x' % (100, 100)

print '----------------'

# 字符串补齐
print '[%3d]' % 2 # 输出 [  2]

print '----------------'

# 整数与小数的位数
print '[%5.3f]' % 3.1415926  # 输出 [3.142]
print '[%.3f]' % 3.1415926   # 输出 [3.142]
print '[%05.3f]' % 3.1415926 # 输出 [3.142]

# 怎样让一个整数/浮点数前面补0 ?

print '----------------'

# 用%%来对%进行转义
print '[growth rate is %.2f%%]' % 15.4765 # 输出 [growth rate is 15.48%] 被自动四舍五入了
 

