# -*- coding:utf-8 -*- 


print '-------------- 切片 （Slice） 操作 list  --------------'

L = ['Tom', 'Li', 'Kate', "ccc", "xt"]

print L[0:3]  # 输出 ['Tom', 'Li', 'Kate']
print L[:3]   # 输出 ['Tom', 'Li', 'Kate']
print L[:]    # 输出 ['Tom', 'Li', 'Kate', 'ccc', 'xt']


# 倒数地取元素 
# 但是取出的若干个元素总是保持原来的顺序
print L[-1]      # 输出 xt
print L[-1:-2]   # 输出 []   
print L[-2:-1]   # 输出 ['ccc']
print L[-2:]     # 输出 ['ccc', 'xt']


L1 = range(100)
print L1[:10]    # 取出前10个元素  输出 [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
print L1[-10:]   # 取出后10个元素  输出 [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

print L1[:10:3]  # 在前10个元素中每隔3个取一次   输出 [0, 3, 6, 9]
print L1[::20]   # 在全部的元素中每隔20个取一次  输出 [0, 20, 40, 60, 80] 


print '-------------- 用 L` = L[:] 来实现list的复制  --------------'

# 直接赋值，则L2只是refer to L1，它们实际指向同一个数据块
L2 = L1
L1[0] = 1000
print L1[0], L2[0]

# 用 L[:] 可以复制一个`新的`List
L2 = L[:]
L[0] = 1000
print L[0], L2[0]  # 输出 1000 Tom



print '-------------- 切片 （Slice） 操作 tuple  --------------'

T1 = (10, 20, 30, 40, 50, 60, 70)
T2 = (10, 20, 30, 40, 50, 60, 70)

print T1[0:3]      # 输出 (10, 20, 30)
print T1[-1:]      # 输出 (70,)



print '-------------- 切片 （Slice） 操作 string  --------------'

S = '0123456789' 
print S[0:4]   # 输出 0123
print S[-4:]   # 输出 6789
print S[::3]   # 输出 0369






